wes-myers-II/imxrt1050-rtos/codec/fsl_dialog7212.h
/* DIALOG7212_MIC_2_GAIN                         0x3A */
#define DIALOG7212_MIC_2_AMP_GAIN_MASK  (0x07)
#define DIALOG7212_MIC_2_AMP_GAIN_SHIFT (0U)
#define DIALOG7212_MIC_2_AMP_GAIN_N6DB  (0U << DIALOG7212_MIC_2_AMP_GAIN_SHIFT)
#define DIALOG7212_MIC_2_AMP_GAIN_0DB   (1U << DIALOG7212_MIC_2_AMP_GAIN_SHIFT)
#define DIALOG7212_MIC_2_AMP_GAIN_P6DB  (2U << DIALOG7212_MIC_2_AMP_GAIN_SHIFT)
#define DIALOG7212_MIC_2_AMP_GAIN_P12DB (3U << DIALOG7212_MIC_2_AMP_GAIN_SHIFT)
#define DIALOG7212_MIC_2_AMP_GAIN_P18DB (4U << DIALOG7212_MIC_2_AMP_GAIN_SHIFT)
#define DIALOG7212_MIC_2_AMP_GAIN_P24DB (5U << DIALOG7212_MIC_2_AMP_GAIN_SHIFT)
#define DIALOG7212_MIC_2_AMP_GAIN_P30DB (6U << DIALOG7212_MIC_2_AMP_GAIN_SHIFT)
#define DIALOG7212_MIC_2_AMP_GAIN_P36DB (7U << DIALOG7212_MIC_2_AMP_GAIN_SHIFT)

/************Output Gain/ Select Filter Registers**********/
/* DIALOG7212_DAC_FILTERS5                       0x40 */
#define DIALOG7212_DAC_FILTERS5_SOFTMUTE_EN_MASK    (1U << 7)
#define DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_MASK  (0x07)
#define DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_SHIFT (4U)
#define DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_1     (0U << DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_SHIFT)
#define DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_2     (1U << DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_SHIFT)
#define DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_4     (2U << DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_SHIFT)
#define DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_8     (3U << DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_SHIFT)
#define DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_16    (4U << DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_SHIFT)
#define DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_32    (5U << DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_SHIFT)
#define DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_64    (6U << DIALOG7212_DAC_FILTERS5_SOFTMUTE_RATE_SHIFT)

/* DIALOG7212_DAC_FILTERS2                       0x41 */
#define DIALOG7212_DAC_FILTERS2_EQ_BAND2_MASK  (0xF0)
#define DIALOG7212_DAC_FILTERS2_EQ_BAND2_SHIFT (4U)
#define DIALOG7212_DAC_FILTERS2_EQ_BAND2(x)    ((x) << DIALOG7212_DAC_FILTERS2_EQ_BAND2_SHIFT)
#define DIALOG7212_DAC_FILTERS2_EQ_BAND1_MASK  (0x0F)
#define DIALOG7212_DAC_FILTERS2_EQ_BAND1_SHIFT (0U)
#define DIALOG7212_DAC_FILTERS2_EQ_BAND1(x)    ((x) << DIALOG7212_DAC_FILTERS2_EQ_BAND1_SHIFT)

/* DIALOG7212_DAC_FILTERS3                       0x42 */
#define DIALOG7212_DAC_FILTERS3_EQ_BAND4_MASK  (0xF0)
#define DIALOG7212_DAC_FILTERS3_EQ_BAND4_SHIFT (4U)
#define DIALOG7212_DAC_FILTERS3_EQ_BAND4(x)    ((x) << DIALOG7212_DAC_FILTERS2_EQ_BAND4_SHIFT)
#define DIALOG7212_DAC_FILTERS3_EQ_BAND3_MASK  (0x0F)
#define DIALOG7212_DAC_FILTERS3_EQ_BAND3_SHIFT (0U)
#define DIALOG7212_DAC_FILTERS3_EQ_BAND3(x)    ((x) << DIALOG7212_DAC_FILTERS2_EQ_BAND3_SHIFT)

/* DIALOG7212_DAC_FILTERS4                       0x43 */
#define DIALOG7212_DAC_FILTERS4_EQ_EN_MASK     (1U << 7)
#define DIALOG7212_DAC_FILTERS4_EQ_BAND5_MASK  (0x0F)
#define DIALOG7212_DAC_FILTERS4_EQ_BAND5_SHIFT (0U)
#define DIALOG7212_DAC_FILTERS4_EQ_BAND5(x)    ((x) << DIALOG7212_DAC_FILTERS2_EQ_BAND5_SHIFT)

/* DIALOG7212_DAC_FILTERS1                       0x44 */
#define DIALOG7212_DAC_FILTERS1_HPF_EN_MASK                (1U << 7)
#define DIALOG7212_DAC_FILTERS1_DAC_AUDIO_HPF_CORNER_MASK  (0x30)
#define DIALOG7212_DAC_FILTERS1_DAC_AUDIO_HPF_CORNER_SHIFT (5U)
#define DIALOG7212_DAC_FILTERS1_DAC_AUDIO_HPF_CORNER_2HZ   (0U << DIALOG7212_DAC_FILTERS1_DAC_AUDIO_HPF_CORNER_SHIFT)
#define DIALOG7212_DAC_FILTERS1_DAC_AUDIO_HPF_CORNER_4HZ   (1U << DIALOG7212_DAC_FILTERS1_DAC_AUDIO_HPF_CORNER_SHIFT)
#define DIALOG7212_DAC_FILTERS1_DAC_AUDIO_HPF_CORNER_8HZ   (2U << DIALOG7212_DAC_FILTERS1_DAC_AUDIO_HPF_CORNER_SHIFT)
#define DIALOG7212_DAC_FILTERS1_DAC_AUDIO_HPF_CORNER_16HZ  (3U << DIALOG7212_DAC_FILTERS1_DAC_AUDIO_HPF_CORNER_SHIFT)
#define DIALOG7212_DAC_FILTERS1_DAC_VOICE_EN_MASK          (1U << 3)
#define DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_MASK  (0x07)
#define DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_SHIFT (0U)
#define DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_2_5HZ (0U << DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_SHIFT)
#define DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_25HZ  (1U << DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_SHIFT)
#define DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_50HZ  (2U << DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_SHIFT)
#define DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_100HZ (3U << DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_SHIFT)
#define DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_150HZ (4U << DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_SHIFT)
#define DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_200HZ (5U << DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_SHIFT)
#define DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_300HZ (6U << DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_SHIFT)
#define DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_400HZ (7U << DIALOG7212_DAC_FILTERS1_DAC_VOICE_HPF_CORNER_SHIFT)

/* DIALOG7212_DAC_L_GAIN                         0x45 */
#define DIALOG7212_DAC_L_DIGITAL_GAIN_MASK  (0x7F)
#define DIALOG7212_DAC_L_DIGITAL_GAIN_SHIFT (0U)
#define DIALOG7212_DAC_L_DIGITAL_GAIN(x)    ((x) << DIALOG7212_DAC_L_DIGITAL_GAIN_SHIFT)

/* DIALOG7212_DAC_R_GAIN                         0x46 */
#define DIALOG7212_DAC_R_DIGITAL_GAIN_MASK  (0x7F)
#define DIALOG7212_DAC_R_DIGITAL_GAIN_SHIFT (0U)
#define DIALOG7212_DAC_R_DIGITAL_GAIN(x)    ((x) << DIALOG7212_DAC_R_DIGITAL_GAIN_SHIFT)

/* DIALOG7212_CP_CTRL                            0x47 */
#define DIALOG7212_CP_CTRL_EN_MASK                    (1U << 7)
#define DIALOG7212_CP_CTRL_SMALL_SWIT_CH_FREQ_EN_MASK (1U << 6)
#define DIALOG7212_CP_CTRL_MCHANGE_MASK               (0x30)
#define DIALOG7212_CP_CTRL_MCHANGE_SHIFT              (4U)
#define DIALOG7212_CP_CTRL_MCHANGE_CP_MOD             (0U << DIALOG7212_CP_CTRL_MCHANGE_SHIFT)
#define DIALOG7212_CP_CTRL_MCHANGE_PGA                (1U << DIALOG7212_CP_CTRL_MCHANGE_SHIFT)
#define DIALOG7212_CP_CTRL_MCHANGE_DAC                (2U << DIALOG7212_CP_CTRL_MCHANGE_SHIFT)
#define DIALOG7212_CP_CTRL_MCHANGE_OUTPUT             (3U << DIALOG7212_CP_CTRL_MCHANGE_SHIFT)
#define DIALOG7212_CP_CTRL_MOD_MASK                   (0x0C)
#define DIALOG7212_CP_CTRL_MOD_SHIFT                  (2U)
#define DIALOG7212_CP_CTRL_MOD_STANDBY                (0U << DIALOG7212_CP_CTRL_MOD_SHIFT)
#define DIALOG7212_CP_CTRL_MOD_CPVDD_2                (2U << DIALOG7212_CP_CTRL_MOD_SHIFT)
#define DIALOG7212_CP_CTRL_MOD_CPVDD_1                (3U << DIALOG7212_CP_CTRL_MOD_SHIFT)
#define DIALOG7212_CP_CTRL_ANALOG_VLL_MASK            (0x03)
#define DIALOG7212_CP_CTRL_ANALOG_VLL_SHIFT           (0U)
#define DIALOG7212_CP_CTRL_ANALOG_VLL_NO_FEEDBACK     (0U << DIALOG7212_CP_CTRL_ANALOG_VLL_SHIFT)
#define DIALOG7212_CP_CTRL_ANALOG_VLL_LV_BOOSTS_CP    (1U << DIALOG7212_CP_CTRL_ANALOG_VLL_SHIFT)
#define DIALOG7212_CP_CTRL_ANALOG_VLL_LV_RESTART_CP   (2U << DIALOG7212_CP_CTRL_ANALOG_VLL_SHIFT)

/* DIALOG7212_HP_L_GAIN                          0x48 */
#define DIALOG7212_HP_L_AMP_GAIN_MASK  (0x3F)
#define DIALOG7212_HP_L_AMP_GAIN_SHIFT (0U)
#define DIALOG7212_HP_L_AMP_GAIN(x)    ((x) << DIALOG7212_HP_L_AMP_GAIN_SHIFT)

/* DIALOG7212_HP_R_GAIN                          0x49 */
#define DIALOG7212_HP_R_AMP_GAIN_MASK  (0x3F)
#define DIALOG7212_HP_R_AMP_GAIN_SHIFT (0U)
#define DIALOG7212_HP_R_AMP_GAIN(x)    ((x) << DIALOG7212_HP_R_AMP_GAIN_SHIFT)

/* DIALOG7212_LINE_GAIN                          0x4A */
#define DIALOG7212_LINE_AMP_GAIN_MASK  (0x3F)
#define DIALOG7212_LINE_AMP_GAIN_SHIFT (0U)
#define DIALOG7212_LINE_AMP_GAIN(x)    ((x) << DIALOG7212_LINE_AMP_GAIN_SHIFT)

/* DIALOG7212_MIXOUT_L_SELECT                    0x4B */
#define DIALOG7212_MIXOUT_L_SELECT_MIXIN_R_INV_MASK (1U << 6)
#define DIALOG7212_MIXOUT_L_SELECT_MIXIN_L_INV_MASK (1U << 5)
#define DIALOG7212_MIXOUT_L_SELECT_AUX_L_INV_MASK   (1U << 4)
#define DIALOG7212_MIXOUT_L_SELECT_DAC_L_MASK       (1U << 3)
#define DIALOG7212_MIXOUT_L_SELECT_MIXIN_R_MASK     (1U << 2)
#define DIALOG7212_MIXOUT_L_SELECT_MIXIN_L_MASK     (1U << 1)
#define DIALOG7212_MIXOUT_L_SELECT_AUX_L_MASK       (1U << 0)

/* DIALOG7212_MIXOUT_R_SELECT                    0x4C */
#define DIALOG7212_MIXOUT_R_SELECT_MIXIN_L_INV_MASK (1U << 6)
#define DIALOG7212_MIXOUT_R_SELECT_MIXIN_R_INV_MASK (1U << 5)
#define DIALOG7212_MIXOUT_R_SELECT_AUX_R_INV_MASK   (1U << 4)
#define DIALOG7212_MIXOUT_R_SELECT_DAC_R_MASK       (1U << 3)
#define DIALOG7212_MIXOUT_R_SELECT_MIXIN_L_MASK     (1U << 2)
#define DIALOG7212_MIXOUT_R_SELECT_MIXIN_R_MASK     (1U << 1)
#define DIALOG7212_MIXOUT_R_SELECT_AUX_R_MASK       (1U << 0)

/**************System Controller Registers(1)*************/
/* DIALOG7212_SYSTEM_MODES_INPUT                 0x50 */
#define DIALOG7212_SYSTEM_MODES_INPUT_ADC_R_MASK       (1U << 7)
#define DIALOG7212_SYSTEM_MODES_INPUT_ADC_L_MASK       (1U << 6)
#define DIALOG7212_SYSTEM_MODES_INPUT_MIXIN_R_MASK     (1U << 5)
#define DIALOG7212_SYSTEM_MODES_INPUT_MIXIN_L_MASK     (1U << 4)
#define DIALOG7212_SYSTEM_MODES_INPUT_MIC_2_MASK       (1U << 3)
#define DIALOG7212_SYSTEM_MODES_INPUT_MIC_1_MASK       (1U << 2)
#define DIALOG7212_SYSTEM_MODES_INPUT_MIC_BIAS_MASK    (1U << 1)
#define DIALOG7212_SYSTEM_MODES_INPUT_MODE_SUBMIT_MASK (1U << 0)

