wes-myers-II/imxrt1050-rtos/codec/fsl_dialog7212.h
/* DIALOG7212_SYSTEM_MODES_OUTPUT                0x51 */
#define DIALOG7212_SYSTEM_MODES_OUTPUT_DAC_R_MASK       (1U << 7)
#define DIALOG7212_SYSTEM_MODES_OUTPUT_DAC_L_MASK       (1U << 6)
#define DIALOG7212_SYSTEM_MODES_OUTPUT_HP_R_MASK        (1U << 5)
#define DIALOG7212_SYSTEM_MODES_OUTPUT_HP_L_MASK        (1U << 4)
#define DIALOG7212_SYSTEM_MODES_OUTPUT_LINE_MASK        (1U << 3)
#define DIALOG7212_SYSTEM_MODES_OUTPUT_AUX_R_MASK       (1U << 2)
#define DIALOG7212_SYSTEM_MODES_OUTPUT_AUX_L_MASK       (1U << 1)
#define DIALOG7212_SYSTEM_MODES_OUTPUT_MODE_SUBMIT_MASK (1U << 0)

/*****************Control Registers(2)********************/
/* DIALOG7212_AUX_L_CTRL                         0x60 */
#define DIALOG7212_AUX_L_CTRL_AMP_EN_MASK               (1U << 7)
#define DIALOG7212_AUX_L_CTRL_AMP_MUTE_EN_MASK          (1U << 6)
#define DIALOG7212_AUX_L_CTRL_AMP_RAMP_EN_MASK          (1U << 5)
#define DIALOG7212_AUX_L_CTRL_AMP_ZC_EN_MASK            (1U << 4)
#define DIALOG7212_AUX_L_CTRL_AMP_ZC_SEL_MASK           (0x0C)
#define DIALOG7212_AUX_L_CTRL_AMP_ZC_SEL_SHIFT          (2U)
#define DIALOG7212_AUX_L_CTRL_AMP_ZC_SEL_INPUT_AUX_L    (0U << DIALOG7212_AUX_L_CTRL_AMP_ZC_SEL_SHIFT)
#define DIALOG7212_AUX_L_CTRL_AMP_ZC_SEL_INPUT_AUX_L_IF (1U << DIALOG7212_AUX_L_CTRL_AMP_ZC_SEL_SHIFT)
#define DIALOG7212_AUX_L_CTRL_AMP_ZC_SEL_NO_ZC_POSSBLE  (2U << DIALOG7212_AUX_L_CTRL_AMP_ZC_SEL_SHIFT)
#define DIALOG7212_AUX_L_CTRL_AMP_ZC_SEL_OUTPUT_AUX_L   (3U << DIALOG7212_AUX_L_CTRL_AMP_ZC_SEL_SHIFT)

/* DIALOG7212_AUX_R_CTRL                         0x61 */
#define DIALOG7212_AUX_R_CTRL_AMP_EN_MASK               (1U << 7)
#define DIALOG7212_AUX_R_CTRL_AMP_MUTE_EN_MASK          (1U << 6)
#define DIALOG7212_AUX_R_CTRL_AMP_RAMP_EN_MASK          (1U << 5)
#define DIALOG7212_AUX_R_CTRL_AMP_ZC_EN_MASK            (1U << 4)
#define DIALOG7212_AUX_R_CTRL_AMP_ZC_SEL_MASK           (0x0C)
#define DIALOG7212_AUX_R_CTRL_AMP_ZC_SEL_SHIFT          (2U)
#define DIALOG7212_AUX_R_CTRL_AMP_ZC_SEL_INPUT_AUX_R    (0U << DIALOG7212_AUX_R_CTRL_AMP_ZC_SEL_SHIFT)
#define DIALOG7212_AUX_R_CTRL_AMP_ZC_SEL_INPUT_AUX_R_IF (1U << DIALOG7212_AUX_R_CTRL_AMP_ZC_SEL_SHIFT)
#define DIALOG7212_AUX_R_CTRL_AMP_ZC_SEL_NO_ZC_POSSBLE  (2U << DIALOG7212_AUX_R_CTRL_AMP_ZC_SEL_SHIFT)
#define DIALOG7212_AUX_R_CTRL_AMP_ZC_SEL_OUTPUT_AUX_R   (3U << DIALOG7212_AUX_R_CTRL_AMP_ZC_SEL_SHIFT)

/* DIALOG7212_MICBIAS_CTRL                       0x62 */
#define DIALOG7212_MICBIAS_CTRL_MICBIAS2_EN_MASK    (1U << 7)
#define DIALOG7212_MICBIAS_CTRL_MICBIAS2_LEVEL_MASK (0x30)
#define DIALOG7212_MICBIAS_CTRL_MICBIAS2_SHIFT      (4U)
#define DIALOG7212_MICBIAS_CTRL_MICBIAS2_1_6V       (0U << DIALOG7212_MICBIAS_CTRL_MICBIAS2_SHIFT)
#define DIALOG7212_MICBIAS_CTRL_MICBIAS2_2_2V       (1U << DIALOG7212_MICBIAS_CTRL_MICBIAS2_SHIFT)
#define DIALOG7212_MICBIAS_CTRL_MICBIAS2_2_5V       (2U << DIALOG7212_MICBIAS_CTRL_MICBIAS2_SHIFT)
#define DIALOG7212_MICBIAS_CTRL_MICBIAS2_3_0V       (3U << DIALOG7212_MICBIAS_CTRL_MICBIAS2_SHIFT)
#define DIALOG7212_MICBIAS_CTRL_MICBIAS1_EN_MASK    (1U << 3)
#define DIALOG7212_MICBIAS_CTRL_MICBIAS1_LEVEL_MASK (0x03)
#define DIALOG7212_MICBIAS_CTRL_MICBIAS1_SHIFT      (0U)
#define DIALOG7212_MICBIAS_CTRL_MICBIAS1_1_6V       (0U << DIALOG7212_MICBIAS_CTRL_MICBIAS1_SHIFT)
#define DIALOG7212_MICBIAS_CTRL_MICBIAS1_2_2V       (1U << DIALOG7212_MICBIAS_CTRL_MICBIAS1_SHIFT)
#define DIALOG7212_MICBIAS_CTRL_MICBIAS1_2_5V       (2U << DIALOG7212_MICBIAS_CTRL_MICBIAS1_SHIFT)
#define DIALOG7212_MICBIAS_CTRL_MICBIAS1_3_0V       (3U << DIALOG7212_MICBIAS_CTRL_MICBIAS1_SHIFT)

/* DIALOG7212_MIC_1_CTRL                         0x63 */
#define DIALOG7212_MIC_1_CTRL_AMP_EN_MASK             (1U << 7)
#define DIALOG7212_MIC_1_CTRL_AMP_MUTE_EN_MASK        (1U << 6)
#define DIALOG7212_MIC_1_CTRL_AMP_IN_SEL_MASK         (0x0C)
#define DIALOG7212_MIC_1_CTRL_AMP_IN_SEL_SHIFT        (2U)
#define DIALOG7212_MIC_1_CTRL_AMP_IN_SEL_DIFFERENTIAL (0U << DIALOG7212_MIC_1_CTRL_AMP_IN_SEL_SHIFT)
#define DIALOG7212_MIC_1_CTRL_AMP_IN_SEL_MIC_1_P      (1U << DIALOG7212_MIC_1_CTRL_AMP_IN_SEL_SHIFT)
#define DIALOG7212_MIC_1_CTRL_AMP_IN_SEL_MIC_1_N      (2U << DIALOG7212_MIC_1_CTRL_AMP_IN_SEL_SHIFT)

/* DIALOG7212_MIC_2_CTRL                         0x64 */
#define DIALOG7212_MIC_2_CTRL_AMP_EN_MASK             (1U << 7)
#define DIALOG7212_MIC_2_CTRL_AMP_MUTE_EN_MASK        (1U << 6)
#define DIALOG7212_MIC_2_CTRL_AMP_IN_SEL_MASK         (0x0C)
#define DIALOG7212_MIC_2_CTRL_AMP_IN_SEL_SHIFT        (2U)
#define DIALOG7212_MIC_2_CTRL_AMP_IN_SEL_DIFFERENTIAL (0U << DIALOG7212_MIC_2_CTRL_AMP_IN_SEL_SHIFT)
#define DIALOG7212_MIC_2_CTRL_AMP_IN_SEL_MIC_2_P      (1U << DIALOG7212_MIC_2_CTRL_AMP_IN_SEL_SHIFT)
#define DIALOG7212_MIC_2_CTRL_AMP_IN_SEL_MIC_2_N      (2U << DIALOG7212_MIC_2_CTRL_AMP_IN_SEL_SHIFT)

/* DIALOG7212_MIXIN_L_CTRL                       0x65 */
#define DIALOG7212_MIXIN_L_CTRL_AMP_EN_MASK      (1U << 7)
#define DIALOG7212_MIXIN_L_CTRL_AMP_MUTE_EN_MASK (1U << 6)
#define DIALOG7212_MIXIN_L_CTRL_AMP_RAMP_EN_MASK (1U << 5)
#define DIALOG7212_MIXIN_L_CTRL_AMP_ZC_EN_MASK   (1U << 4)
#define DIALOG7212_MIXIN_L_CTRL_AMP_MIX_EN_MASK  (1U << 3)

/* DIALOG7212_MIXIN_R_CTRL                       0x66 */
#define DIALOG7212_MIXIN_R_CTRL_AMP_EN_MASK      (1U << 7)
#define DIALOG7212_MIXIN_R_CTRL_AMP_MUTE_EN_MASK (1U << 6)
#define DIALOG7212_MIXIN_R_CTRL_AMP_RAMP_EN_MASK (1U << 5)
#define DIALOG7212_MIXIN_R_CTRL_AMP_ZC_EN_MASK   (1U << 4)
#define DIALOG7212_MIXIN_R_CTRL_AMP_MIX_EN_MASK  (1U << 3)

/* DIALOG7212_ADC_L_CTRL                         0x67 */
#define DIALOG7212_ADC_L_CTRL_ADC_EN_MASK      (1U << 7)
#define DIALOG7212_ADC_L_CTRL_ADC_MUTE_EN_MASK (1U << 6)
#define DIALOG7212_ADC_L_CTRL_ADC_RAMP_EN_MASK (1U << 5)

/* DIALOG7212_ADC_R_CTRL                         0x68 */
#define DIALOG7212_ADC_R_CTRL_ADC_EN_MASK      (1U << 7)
#define DIALOG7212_ADC_R_CTRL_ADC_MUTE_EN_MASK (1U << 6)
#define DIALOG7212_ADC_R_CTRL_ADC_RAMP_EN_MASK (1U << 5)

/* DIALOG7212_DAC_L_CTRL                         0x69 */
#define DIALOG7212_DAC_L_CTRL_ADC_EN_MASK      (1U << 7)
#define DIALOG7212_DAC_L_CTRL_ADC_MUTE_EN_MASK (1U << 6)
#define DIALOG7212_DAC_L_CTRL_ADC_RAMP_EN_MASK (1U << 5)

/* DIALOG7212_DAC_R_CTRL                         0x6A */
#define DIALOG7212_DAC_R_CTRL_ADC_EN_MASK      (1U << 7)
#define DIALOG7212_DAC_R_CTRL_ADC_MUTE_EN_MASK (1U << 6)
#define DIALOG7212_DAC_R_CTRL_ADC_RAMP_EN_MASK (1U << 5)

